import React from 'react';
import './service.css'
import samokat from '../../assets/remontsamakata.png'
import samokatik from '../../assets/samokatik.png'
import '../Adaptive/adaptive.css'

const Service = () => {
    return (
        <div className='service'>
       <div className='service__block-1'>
           <h1 className="service__title">Ремонт и обслуживание товаров Kugoo Kirin</h1>
           <p className="service__subtitle">в фирменных сервисых центрах</p>
           <ul className="service__list">
               <li className="service__list-item">
                   <div className="card__background">
                       <svg  width="14" height="16" viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                           <path d="M11.7441 1.96473C10.4772 0.697753 8.79263 0 7.00093 0C5.20921 0 3.5247 0.697721 2.25766 1.96473C0.990722 3.23167 0.292969 4.91611 0.292969 6.70784C0.292969 8.49956 0.990722 10.1841 2.25766 11.451L6.66949 15.8627C6.76103 15.9543 6.881 16 7.00093 16C7.1209 16 7.24087 15.9542 7.33237 15.8627L11.744 11.4511C13.011 10.1841 13.7087 8.4996 13.7088 6.70787C13.7087 4.91608 13.0111 3.23164 11.7441 1.96473ZM9.10757 8.81441C8.54488 9.3771 7.79675 9.68701 7.00097 9.68701C6.20518 9.68701 5.45705 9.37713 4.89439 8.81444C4.33167 8.25175 4.0218 7.50362 4.0218 6.70784C4.0218 5.91209 4.33167 5.16396 4.89439 4.60124C5.45705 4.03855 6.20518 3.72867 7.00097 3.72867C7.79675 3.72867 8.54488 4.03855 9.10757 4.60124C9.67026 5.1639 9.98016 5.91202 9.98016 6.70781C9.98013 7.50359 9.67023 8.25175 9.10757 8.81441Z" fill="white"/>
                       </svg>
                   </div>
                   <p className="service__card-subtitle">Сервисные центры в Москве, <br/> Санкт-Петербурге и Краснодаре</p>
               </li>
               <li className="service__list-item">
                   <div className="card__background">
                       <svg  width="14" height="16" viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                           <path d="M13.7145 4.11839C13.6954 3.69746 13.6954 3.29567 13.6954 2.89387C13.6954 2.56861 13.4467 2.31988 13.1214 2.31988C10.7298 2.31988 8.91213 1.63109 7.40062 0.157848C7.17102 -0.0526158 6.82663 -0.0526158 6.59703 0.157848C5.08552 1.63109 3.26788 2.31988 0.876255 2.31988C0.550993 2.31988 0.302264 2.56861 0.302264 2.89387C0.302264 3.29567 0.302264 3.69746 0.283131 4.11839C0.206599 8.13632 0.0918003 13.6466 6.8075 15.9617L6.99883 16L7.19016 15.9617C13.8867 13.6466 13.7911 8.15546 13.7145 4.11839ZM6.53963 9.6861C6.42483 9.78176 6.2909 9.83916 6.13784 9.83916H6.11871C5.96564 9.83916 5.81258 9.76263 5.71691 9.64783L3.93754 7.67713L4.79853 6.91181L6.19524 8.46158L9.29479 5.5151L10.0792 6.35695L6.53963 9.6861Z" fill="white"/>
                       </svg>
                   </div>
                   <p className="service__card-subtitle">Гарантия 14 дней<br/>
                       на ремонт</p>
               </li>
               <li className="service__list-item">
                   <div className="card__background">
                       <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                       <path d="M15.6235 6.17822L14.3938 5.91089C14.2869 5.5835 14.1544 5.26416 13.998 4.95654L14.6788 3.89758C14.8004 3.70837 14.7737 3.45996 14.6147 3.30103L12.699 1.38525C12.54 1.22632 12.2916 1.19958 12.1024 1.32117L11.0435 2.00195C10.7358 1.84558 10.4165 1.71313 10.0891 1.6062L9.82178 0.376465C9.77405 0.156738 9.57947 0 9.35461 0H6.64539C6.42053 0 6.22595 0.156738 6.17822 0.376465L5.91089 1.6062C5.5835 1.71313 5.26416 1.84558 4.95654 2.00195L3.89758 1.32117C3.70837 1.19958 3.45996 1.22632 3.30103 1.38525L1.38525 3.30103C1.22632 3.45996 1.19958 3.70837 1.32117 3.89758L2.00195 4.95654C1.84558 5.26416 1.71313 5.5835 1.6062 5.91089L0.376465 6.17822C0.156738 6.22607 0 6.42053 0 6.64539V9.35461C0 9.57947 0.156738 9.77393 0.376465 9.82178L1.6062 10.0891C1.71313 10.4165 1.84558 10.7358 2.00195 11.0435L1.32117 12.1024C1.19958 12.2916 1.22632 12.54 1.38525 12.699L3.30103 14.6147C3.45996 14.7737 3.70837 14.8004 3.89758 14.6788L4.95654 13.998C5.26416 14.1544 5.5835 14.2869 5.91089 14.3938L6.17822 15.6235C6.22595 15.8433 6.42053 16 6.64539 16H9.35461C9.57947 16 9.77405 15.8433 9.82178 15.6235L10.0891 14.3938C10.4165 14.2869 10.7358 14.1544 11.0435 13.998L12.1024 14.6788C12.2916 14.8004 12.54 14.7738 12.699 14.6147L14.6147 12.699C14.7737 12.54 14.8004 12.2916 14.6788 12.1024L13.998 11.0435C14.1544 10.7358 14.2869 10.4165 14.3938 10.0891L15.6235 9.82178C15.8433 9.77393 16 9.57947 16 9.35461V6.64539C16 6.42053 15.8433 6.22607 15.6235 6.17822ZM10.8685 8C10.8685 9.58167 9.58167 10.8685 8 10.8685C6.41833 10.8685 5.13147 9.58167 5.13147 8C5.13147 6.41833 6.41833 5.13147 8 5.13147C9.58167 5.13147 10.8685 6.41833 10.8685 8Z" fill="white"/>
                   </svg>
                   </div>

                   <p className="service__card-subtitle">Всегда в наличии оригинальные <br/> запчасти
                       от производителя</p>
               </li>
           </ul>
           <a href="#service" className='service__block-1-btn'>Перейти</a>
       </div>
       <div className='service__block-2'>
           <h1 className="service__block-2-title">Проведем диагностику <br/>
               и отремонтируем любую неисправность</h1>
           <div className="service__block-2-blocks">
               <div className="service__block-2-box">
                    <div className="service__block-2-box-2">
                        <h1 className="service__block-2-box-2-title">Ремонт от 1 дня</h1>
                        <p className="service__block-2-box-2-subtitle">Устраним любую неисправность. Обычно <br/> делаем это за 1-3 дня, если ремонт <br/> сложный — предупредим заранее.</p>
                    </div>
                    <div className="service__block-2-box-2">
                        <h1 className="service__block-2-box-2-title">Ремонтируем только <br/> то, что сломалось</h1>
                        <p className="service__block-2-box-2-subtitle">Не навязываем услуги, диагностируем <br/>
                            и заранее обговариваем стоимость ремонта.</p>
                    </div>
                    <div className="service__block-2-box-2">
                        <h1 className="service__block-2-box-2-title">Оригинальные запчасти</h1>
                        <p className="service__block-2-box-2-subtitle">Благодаря прямой связи с производителем <br/> имеем в наличии все необходимые новые <br/> комплектующие для ремонта.</p>
                    </div>
               </div>
               <img className='service__samokat-img' src={samokat} alt="samokat"/>
               <div className="service__block-2-box">
                   <div className="service__block-2-box">
                       <div className="service__block-2-box-2">
                           <h1 className="service__block-2-box-2-title">гарантия</h1>
                           <p className="service__block-2-box-2-subtitle">14 дней на ремонт</p>
                       </div>
                       <div className="service__block-2-box-2">
                           <h1 className="service__block-2-box-2-title">бесплатный ремонт</h1>
                           <p className="service__block-2-box-2-subtitle">в течение 1 года после покупки</p>
                       </div>
                       <div className="service__block-2-box-2">
                           <h1 className="service__block-2-box-2-title">расширенная гарантия</h1>
                           <p className="service__block-2-box-2-subtitle">до 36 месяцев</p>
                       </div>
                   </div>
               </div>
           </div>

       </div>
       <div className='service__block-3'>
           <div className="service__box-3">
               <div className="service__box-3-block">
                   <img className='service__box-3-img' src={samokatik} alt="samokat"/>
                   <div className='service__text-block'>
                       <h1 className='service__box-3-title'>Сделаем гидроизоляцию <br/> электросамоката</h1>
                       <p className='service__box-3-subtitle'>которая позволит вам кататься в любую погоду</p>
                       <p className='service__box-3-subtitle'>Гидроизоляция – это защита от проникновения воды. Электросамокат <br/> изнутри покрывается специальным веществом, которое предотвращает <br/> попадание любой влаги.</p>
                       <p className='service__box-3-subtitle-2'>Что дает гидроизоляция:</p>
                       <ul className='service__box-3-list'>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Возможность выезжать в дождь или после дождя</p>
                           </li>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Можно ездить в любое время года</p>
                           </li>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Защита от влаги, пыли и грязи продлит срок беспроблемного <br/> использования.</p>
                           </li>
                       </ul>
                   </div>
               </div>
           </div>
           <div className="service__box-3">
               <div className="service__box-3-block">
                   <div className='service__text-block'>
                       <h1 className='service__box-3-title'>Продлим срок службы <br/> вашего самоката в 2 раза</h1>
                       <p className='service__box-3-subtitle'>благодаря настройкам от специалистов с опытом 7+ лет</p>
                       <p className='service__box-3-subtitle'>Перед продажей каждый покупатель может заказать у нас <br/> дополнительную услугу – настройка самоката. Для разных моделей <br/> Kugoo настройка может отличаться.</p>
                       <p className='service__box-3-subtitle-2'>Что входит в настройку:</p>
                       <ul className='service__box-3-list'>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Регулировка натяжения тормозного троса</p>
                           </li>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Регулировка положения тормозной ручки</p>
                           </li>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Регулировка тормозных механизмов</p>
                           </li>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p className='service__box-3-list-item-text'>Протяжка всех соединений</p>
                           </li>
                           <li className='service__box-3-list-item'>
                               <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                                   <path d="M11.6037 5.86035H10.8251C10.6558 5.86035 10.4948 5.9417 10.3952 6.08115L7.78538 9.70029L6.60334 8.06006C6.50373 7.92227 6.34435 7.83926 6.17336 7.83926H5.39474C5.28683 7.83926 5.22375 7.96211 5.28683 8.0501L7.35539 10.9188C7.40426 10.9871 7.46868 11.0426 7.54331 11.081C7.61795 11.1193 7.70064 11.1393 7.78455 11.1393C7.86845 11.1393 7.95115 11.1193 8.02578 11.081C8.10041 11.0426 8.16483 10.9871 8.2137 10.9188L11.71 6.07119C11.7747 5.9832 11.7117 5.86035 11.6037 5.86035Z" fill="#6F73EE"/>
                                   <path d="M8.5 1.0625C4.39277 1.0625 1.0625 4.39277 1.0625 8.5C1.0625 12.6072 4.39277 15.9375 8.5 15.9375C12.6072 15.9375 15.9375 12.6072 15.9375 8.5C15.9375 4.39277 12.6072 1.0625 8.5 1.0625ZM8.5 14.6758C5.09004 14.6758 2.32422 11.91 2.32422 8.5C2.32422 5.09004 5.09004 2.32422 8.5 2.32422C11.91 2.32422 14.6758 5.09004 14.6758 8.5C14.6758 11.91 11.91 14.6758 8.5 14.6758Z" fill="#6F73EE"/>
                               </svg>
                               <p id={'service'} className='service__box-3-list-item-text'>И еще более 35 работ.</p>
                           </li>
                       </ul>
                   </div>

                   <img className='service__box-3-img' src={samokat} alt="samokat"/>
               </div>
           </div>
       </div>
        </div>
    );
};

export default Service;