import React from 'react';
import './politic.css'


const Politic = () => {
    return (
        <div className='politic'>
            <h1 className='politic__title'>Политика конфиденциальности</h1>
            <p className='politic__subtitle'>Настоящая Политика конфиденциальности персональных данных (далее - Политика конфиденциальности) действует в <br/>
            отношении всей информации, размещенной на сайте в сети Интернет по адресу: https://kugoo-russia.ru (далее - Сайт), которую <br/>
            сотрудники и представители Оператора могут получить о Пользователе во время использования Сайта, его сервисов, <br/>
            программ и продуктов.
            </p>
            <p className='politic__subtitle'>Использование сервисов Сайта означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней <br/>
            условиями обработки его персональной информации; в случае несогласия с этими условиями Пользователь должен <br/>
            воздержаться от использования сервисов.</p>

            <p className='politic__subtitle'>1. ОБЩИЕ ПОЛОЖЕНИЯ</p>
            <ul className='politic__list'>
                    <li className='politic__list-item'>1.1. В рамках настоящей Политики под персональной информацией Пользователя понимаются:</li>
                    <li className='politic__list-item'>1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации (создании <br/>
                    учетной записи) или в процессе использования Сервисов, включая персональные данные. Иная информация предоставляется <br/>
                    Пользователем на его усмотрение.</li>
                    <li className='politic__list-item'>1.1.2. Данные, которые автоматически передаются сервисам Сайта в процессе их использования с помощью установленного на <br/>
                    устройстве Пользователя программного обеспечения, в том числе IP-адрес, данные файлов cookie, информация о браузере <br/>
                    Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики <br/>
                    оборудования и программного обеспечения, используемых Пользователем, дата и время доступа к сервисам, адреса <br/>
                    запрашиваемых страниц и иная подобная информация.</li>
                   <li className='politic__list-item'>1.1.3. Иная информация о Пользователе, обработка которой предусмотрена Пользовательским соглашением сайта.</li>
                   <li className='politic__list-item'>1.1.4. Настоящая Политика конфиденциальности применяется только к Сайту https://kugoo-russia.ru. Сайт kugoo-russia.ru не <br/>
                   контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным <br/>
                   на Сайте https://kugoo-russia.ru.
                   </li>
            </ul>
            <p className='politic__subtitle'>2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</p>
            <ul className='politic__list'>
                <li className='politic__list-item'>
                    2.1. Сайт собирает и хранит только ту персональную информацию, которая необходима для предоставления сервисов или <br/>
                    исполнения соглашений и договоров с Пользователем, за исключением случаев, когда законодательством предусмотрено <br/>
                    обязательное хранение персональной информации в течение определенного законом срока.</li>
            </ul>
            <li className='politic__list-item'>2.2. Персональную информацию Пользователя Сайт обрабатывает в следующих целях:</li>
            <li className='politic__list-item'>2.2.1. Идентификации Пользователя, зарегистрированного на Сайте, для предоставления информации, подобранной с учетом <br/> индивидуальных запросов Пользователя.</li>
            <li className='politic__list-item'>2.2.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта.</li>
            <li className='politic__list-item'>2.2.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования <br/> Сайта, оказания услуг, обработку запросов и заявок от Пользователя.</li>
            <li className='politic__list-item'>2.2.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</li>
            <li className='politic__list-item'>2.2.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</li>
            <li className='politic__list-item'>2.2.6. Создания учетной записи для предоставления доступа к персонализированным ресурсам Сайта, если Пользователь дал <br/> согласие на создание учетной записи.</li>
            <li className='politic__list-item'>2.2.7. Уведомления Пользователя Сайта о новых товарах и услугах, рекламных акциях, изменениях в графике работы.</li>
            <li className='politic__list-item'>2.2.8. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных <br/>
            с использованием Сайта.</li>
            <li className='politic__list-item'>2.2.9. Осуществления рекламной деятельности с согласия Пользователя.</li>
            <p className='politic__subtitle'>3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ <br/>
            И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ
            </p>
            <ul className='politic__list'>
                <li className='politic__list-item'>3.1. Сайт хранит персональную информацию Пользователей в соответствии с внутренними регламентами конкретных сервисов.</li>
                <li className='politic__list-item'>3.2. В отношении персональной информации Пользователя сохраняется ее конфиденциальность, кроме случаев добровольного <br/> предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании <br/> отдельных сервисов Пользователь соглашается с тем, что определенная часть его персональной информации становится <br/> общедоступной.</li>
                <li className='politic__list-item'>3.3. Сайт вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:</li>
                <li className='politic__list-item'>3.3.1. Пользователь выразил согласие на такие действия.</li>
                <li className='politic__list-item'>3.3.2. Передача необходима для использования Пользователем определенного сервиса либо для исполнения определенного <br/> соглашения или договора с Пользователем.</li>
                <li className='politic__list-item'>3.3.4. Передача предусмотрена российским или иным применимым законодательством в рамках <br/> установленной законодательством процедуры.</li>
                <li className='politic__list-item'>
                    3.3.5. В случае продажи Сайта к приобретателю переходят все обязательства по соблюдению условий настоящей <br/> Политики применительно к полученной им персональной информации.</li>
                <li className='politic__list-item'>3.4. Обработка персональных данных Пользователя осуществляется без ограничения срока любым законным способом, в том <br/> числе в информационных системах персональных данных с использованием средств автоматизации или без использования <br/> таких средств. Обработка персональных данных Пользователей осуществляется в соответствии с Федеральным законом от <br/> 27.07.2006 N 152-ФЗ "О персональных данных".</li>
                <li className='politic__list-item'>3.5. При утрате или разглашении персональных данных Администрация Сайта информирует Пользователя об утрате или <br/> разглашении персональных данных.</li>
                <li className='politic__list-item'>3.6. Администрация Сайта принимает необходимые организационные и технические меры для защиты персональной <br/>
                информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, <br/>
                распространения, а также от иных неправомерных действий третьих лиц.
                </li>
                <li className='politic__list-item'>
                    3.7. Администрация Сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных <br/> отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</li>
            </ul>
            <p className='politic__subtitle'>
                4. ОБЯЗАТЕЛЬСТВА СТОРОН
            </p>
            <ul className='politic__list'>
                    <li className='politic__list-item'>4.1. Пользователь обязан:</li>
                    <li className='politic__list-item'>4.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом.
                    </li>
                    <li className='politic__list-item'>4.1.2. Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.
                    </li>
                    <li className='politic__list-item'>4.2. Администрация Сайта обязана:
                    </li>
                <li className='politic__list-item'>4.2.1. Использовать полученную информацию исключительно для целей, указанных в настоящей Политике конфиденциальности.
                </li>
                <li className='politic__list-item'>4.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного <br/> разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование либо разглашение иными возможными <br/> способами переданных персональных данных Пользователя, за исключением предусмотренных настоящей Политикой <br/> конфиденциальности.
                </li>
                <li className='politic__list-item'>4.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно <br/> порядку, обычно используемому для защиты такого рода информации в существующем деловом обороте.</li>
                <li className='politic__list-item'>4.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения <br/>
                или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов <br/>
                персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных <br/> действий.</li>
            </ul>


            <p className='politic__subtitle'>5. ОТВЕТСТВЕННОСТЬ СТОРОН</p>

            <ul className='politic__list'>
                <li className='politic__list-item'>
                    5.1. Администрация Сайта, не исполнившая свои обязательства, несет ответственность за убытки, понесенные Пользователем <br/> в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.</li>
                <li className='politic__list-item'>5.2. В случае утраты или разглашения конфиденциальной информации Администрация Сайта не несет ответственности, <br/> если данная конфиденциальная информация:</li>
                <li className='politic__list-item'>5.2.1. Стала публичным достоянием до ее утраты или разглашения</li>
                <li className='politic__list-item'>5.2.2. Была получена от третьей стороны до момента ее получения Администрацией Сайта.</li>
                <li className='politic__list-item'>5.2.3. Была разглашена с согласия Пользователя.</li>

            </ul>

            <p className='politic__subtitle'>6. РАЗРЕШЕНИЕ СПОРОВ</p>

            <ul className='politic__list'>
                <li className='politic__list-item'>6.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем Сайта и Администрацией Сайта, <br/>
                обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).</li>
                <li className='politic__list-item'>6.2. Получатель претензии в течение 10 календарных дней со дня получения претензии письменно уведомляет заявителя <br/> претензии о результатах рассмотрения претензии.</li>
                <li className='politic__list-item'>6.3. При недостижении соглашения спор будет передан на рассмотрение в суд в соответствии с действующим <br/> законодательством Российской Федерации.</li>
                <li className='politic__list-item'>6.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией Сайта применяется <br/> действующее законодательство Российской Федерации.</li>

            </ul>
            <p className='politic__subtitle'>7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</p>
            <ul className='politic__list'>
                <li className='politic__list-item'>7.1. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</li>
                <li className='politic__list-item'>7.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено <br/>
                новой редакцией Политики конфиденциальности.
                </li>
                <li className='politic__list-item'>7.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать по адресу электронной почты <br/>
                info@kugoo-russia.ru.</li>
                <li className='politic__list-item'>7.4. Действующая Политика конфиденциальности размещена на странице по адресу: https://kugoo-russia.ru.</li>
                <li className='politic__list-item'>7.5. Настоящая Политика конфиденциальности является неотъемлемой частью Пользовательского соглашения, размещенного на <br/> странице по адресу: https://kugoo-russia.ru.</li>
            </ul>
        </div>
    );
};

export default Politic;